Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
units_0 (Dense)              (None, 256)               22784     
_________________________________________________________________
units_1 (Dense)              (None, 512)               131584    
_________________________________________________________________
units_2 (Dense)              (None, 768)               393984    
_________________________________________________________________
units_3 (Dense)              (None, 512)               393728    
_________________________________________________________________
dense (Dense)                (None, 50)                25650     
=================================================================
Total params: 967,730
Trainable params: 967,730
Non-trainable params: 0
_________________________________________________________________
